{"source": "github", "metadata": {"org": "flutter", "repo": "engine", "issue": 37343}, "content": {"author": {"login": "fzyzcjy"}, "body": "This PR is just a rough sketch. If it looks OK, I will polish (e.g. add tests, refine code etc)\r\n\r\nPrevious:  https://github.com/flutter/engine/pull/36912\r\n\r\nBackground: The original proposal completely removes back-pressure. Thus, suppose a rasterzation takes 1000ms, then we will be running ui thread unnecessarily for 60 times.\r\n\r\nProposed new change: Maybe we should conditionally remove back-pressure. More specifically, when we see PipelineFull, we *only* ignore it and continue running ui thread under the following condition: The current ongoing rasterization has not been running for a long time. This condition holds for the figure in my previous comment, so the main scenario that this PR wants to solve is happy. On the other hand, for the \"1000ms-long-rasterization\" case, we will only waste one single ui pipeline computation, instead of 60 computations, so the waste does not look like a lot. I agree one waste is indeed waste, but it is the cost to pay (user battery consumes a tiny bit more) if we want to make the UI that user feels completely smooth at 60FPS (which is one of the goals of Flutter IMHO).\r\n\r\nRemark: Code comments also describe this as well.", "comments": [{"id": "IC_kwDOAlZRSc5NwvBo", "author": {"login": "dnfield"}, "authorAssociation": "MEMBER", "body": "No, conditionally removing back-pressure is still bad: it will cause other problems for sure, since we're conditionally letting the CPU get ahead of the GPU. It'll just be harder to figure out when that's happening and fix it.", "createdAt": "2022-11-05T19:45:57Z", "includesCreatedEdit": false, "isMinimized": false, "minimizedReason": "", "reactionGroups": [], "url": "https://github.com/flutter/engine/pull/37343#issuecomment-1304621160"}, {"id": "IC_kwDOAlZRSc5Nw161", "author": {"login": "fzyzcjy"}, "authorAssociation": "CONTRIBUTOR", "body": "@dnfield \r\n\r\n> it will cause other problems for sure, since we're conditionally letting the CPU get ahead of the GPU. It'll just be harder to figure out when that's happening and fix it.\r\n\r\nMay I know a bit more about \"other problems\"? Because without knowing more, I have no idea what they are thus how to solve it.", "createdAt": "2022-11-05T21:59:41Z", "includesCreatedEdit": false, "isMinimized": false, "minimizedReason": "", "reactionGroups": [{"content": "HEART", "users": {"totalCount": 1}}], "url": "https://github.com/flutter/engine/pull/37343#issuecomment-1304649397"}, {"id": "IC_kwDOAlZRSc5N95lO", "author": {"login": "fzyzcjy"}, "authorAssociation": "CONTRIBUTOR", "body": "For future readers: This is discussed in https://discord.com/channels/608014603317936148/1039667632342835250", "createdAt": "2022-11-09T01:32:10Z", "includesCreatedEdit": false, "isMinimized": false, "minimizedReason": "", "reactionGroups": [], "url": "https://github.com/flutter/engine/pull/37343#issuecomment-1308072270"}], "createdAt": "2022-11-05T06:37:08Z", "title": "Remove (3N-1) jank and big-jump when N rasterization misses deadline (V2)"}}